orzel/olimex-bsp/olimex_esp32_p4_pc_noglib/olimex_esp32_p4_pc.c
esp_err_t bsp_display_new(const bsp_display_config_t *config, esp_lcd_panel_handle_t *ret_panel,
                          esp_lcd_panel_io_handle_t *ret_io)
{
    esp_err_t ret = ESP_OK;
    bsp_lcd_handles_t handles;
    ret = bsp_display_new_with_handles(config, &handles);

    *ret_panel = handles.panel;
    *ret_io = handles.io;

    return ret;
}

esp_err_t bsp_display_new_with_handles(const bsp_display_config_t *config, bsp_lcd_handles_t *ret_handles)
{
    esp_err_t ret = ESP_OK;
    esp_lcd_panel_io_handle_t io = NULL;
    esp_lcd_panel_handle_t disp_panel = NULL;

    ESP_RETURN_ON_ERROR(bsp_enable_dsi_phy_power(), TAG, "DSI PHY power failed");

    /* create MIPI DSI bus first, it will initialize the DSI PHY as well */
    esp_lcd_dsi_bus_handle_t mipi_dsi_bus = NULL;
    esp_lcd_dsi_bus_config_t bus_config = {
        .bus_id = 0,
        .num_data_lanes = BSP_LCD_MIPI_DSI_LANE_NUM,
        .phy_clk_src = config->dsi_bus.phy_clk_src,
        .lane_bit_rate_mbps = config->dsi_bus.lane_bit_rate_mbps,
    };
    ESP_RETURN_ON_ERROR(esp_lcd_new_dsi_bus(&bus_config, &mipi_dsi_bus), TAG, "New DSI bus init failed");

    ESP_LOGI(TAG, "Install MIPI DSI HDMI control panel");
    ESP_RETURN_ON_ERROR(bsp_i2c_init(), TAG, "I2C init failed");

    /* Main IO */
    esp_lcd_panel_io_i2c_config_t io_config = LT8912B_IO_CFG(CONFIG_BSP_I2C_CLK_SPEED_HZ, LT8912B_IO_I2C_MAIN_ADDRESS);
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_handle, &io_config, &io));

    /* CEC DSI IO */
    esp_lcd_panel_io_handle_t io_cec_dsi = NULL;
    esp_lcd_panel_io_i2c_config_t io_config_cec = LT8912B_IO_CFG(CONFIG_BSP_I2C_CLK_SPEED_HZ, LT8912B_IO_I2C_CEC_ADDRESS);
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_handle, &io_config_cec, &io_cec_dsi));

    /* AVI IO */
    esp_lcd_panel_io_handle_t io_avi = NULL;
    esp_lcd_panel_io_i2c_config_t io_config_avi = LT8912B_IO_CFG(CONFIG_BSP_I2C_CLK_SPEED_HZ, LT8912B_IO_I2C_AVI_ADDRESS);
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_i2c(i2c_handle, &io_config_avi, &io_avi));

    esp_lcd_dpi_panel_config_t dpi_configs[] = {
        LT8912B_800x600_PANEL_60HZ_DPI_CONFIG_WITH_FBS(CONFIG_BSP_LCD_DPI_BUFFER_NUMS),
        LT8912B_1024x768_PANEL_60HZ_DPI_CONFIG_WITH_FBS(CONFIG_BSP_LCD_DPI_BUFFER_NUMS),
        LT8912B_1280x720_PANEL_60HZ_DPI_CONFIG_WITH_FBS(CONFIG_BSP_LCD_DPI_BUFFER_NUMS),
        LT8912B_1280x800_PANEL_60HZ_DPI_CONFIG_WITH_FBS(CONFIG_BSP_LCD_DPI_BUFFER_NUMS),
        LT8912B_1920x1080_PANEL_30HZ_DPI_CONFIG_WITH_FBS(CONFIG_BSP_LCD_DPI_BUFFER_NUMS)
    };

#if CONFIG_BSP_LCD_USE_DMA2D && (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(6, 0, 0))
    for (int i = 0; i < sizeof(dpi_configs) / sizeof(dpi_configs[0]); i++) {
        dpi_configs[i].flags.use_dma2d = true;
    }
#endif

    const esp_lcd_panel_lt8912b_video_timing_t video_timings[] = {
        ESP_LCD_LT8912B_VIDEO_TIMING_800x600_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1024x768_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1280x720_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1280x800_60Hz(),
        ESP_LCD_LT8912B_VIDEO_TIMING_1920x1080_30Hz()
    };
    lt8912b_vendor_config_t vendor_config = {
        .mipi_config = {
            .dsi_bus = mipi_dsi_bus,
            .lane_num = BSP_LCD_MIPI_DSI_LANE_NUM,
        },
    };

    /* DPI config */
    switch (config->hdmi_resolution) {
    case BSP_HDMI_RES_800x600:
        ESP_LOGI(TAG, "HDMI configuration for 800x600@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[0];
        memcpy(&vendor_config.video_timing, &video_timings[0], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1024x768:
        ESP_LOGI(TAG, "HDMI configuration for 1024x768@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[1];
        memcpy(&vendor_config.video_timing, &video_timings[1], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1280x720:
        ESP_LOGI(TAG, "HDMI configuration for 1280x720@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[2];
        memcpy(&vendor_config.video_timing, &video_timings[2], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1280x800:
        ESP_LOGI(TAG, "HDMI configuration for 1280x800@60HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[3];
        memcpy(&vendor_config.video_timing, &video_timings[3], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    case BSP_HDMI_RES_1920x1080:
        ESP_LOGI(TAG, "HDMI configuration for 1920x1080@30HZ");
        vendor_config.mipi_config.dpi_config = &dpi_configs[4];
        memcpy(&vendor_config.video_timing, &video_timings[4], sizeof(esp_lcd_panel_lt8912b_video_timing_t));
        break;
    default:
        ESP_LOGE(TAG, "Unsupported display type (%d)", config->hdmi_resolution);
    }


    const esp_lcd_dpi_panel_config_t *dpi = vendor_config.mipi_config.dpi_config;
    ESP_LOGI(TAG, "DPI: pclk=%.3f h=%u v=%u", (double)dpi->dpi_clock_freq_mhz, (unsigned)dpi->video_timing.h_size, (unsigned)dpi->video_timing.v_size);


    const esp_lcd_panel_dev_config_t panel_config = {
        .bits_per_pixel = 24,
        .rgb_ele_order = BSP_LCD_COLOR_SPACE,
        .reset_gpio_num = BSP_LCD_RST,
        .vendor_config = &vendor_config,
    };
    const esp_lcd_panel_lt8912b_io_t io_all = {
        .main = io,
        .cec_dsi = io_cec_dsi,
        .avi = io_avi,
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_lt8912b(&io_all, &panel_config, &disp_panel));

#if CONFIG_BSP_LCD_USE_DMA2D && (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(6, 0, 0))
    ESP_GOTO_ON_ERROR(esp_lcd_dpi_panel_enable_dma2d(disp_panel), err, TAG, "LCD panel enable DMA2D failed");
#endif

    ESP_GOTO_ON_ERROR(esp_lcd_panel_reset(disp_panel), err, TAG, "LCD panel reset failed");

    ESP_GOTO_ON_ERROR(esp_lcd_panel_init(disp_panel), err, TAG, "LCD panel init failed");

    /* Return all handles */
    ret_handles->io = io;
    disp_handles.io = io;
    ret_handles->io_cec = io_cec_dsi;
    disp_handles.io_cec = io_cec_dsi;
    ret_handles->io_avi = io_avi;
    disp_handles.io_avi = io_avi;
    ret_handles->mipi_dsi_bus = mipi_dsi_bus;
    disp_handles.mipi_dsi_bus = mipi_dsi_bus;
    ret_handles->panel = disp_panel;
    disp_handles.panel = disp_panel;
    ret_handles->control = NULL;
    disp_handles.control = NULL;

